;	★ RGB 	《汇编语言》P188
;	一、DOS 屏幕
;		80x25 彩色字符模式：
;			显示器可以显示25行，每行80个字符(Byte). 每个字符可以有256种属性(闪烁，背景色，高亮，前景色等组合信息).
;			一个字符占两个存储空间(ASCII-低位 + 属性-高位).
;			
;	二、显示缓冲区
;		内存地址空间为 B8000h-BFFFFh 共 32KB 空间.
;
;				00 01 02 03 04 05 06 07 08 09 0A 0B 0C 0D 0E 0F
;	B800:0000	41 02 .. .. .. .. .. .. .. .. .. .. .. .. .. ..
;		:
;	B800:0090	.. .. .. .. .. .. .. .. .. .. .. .. .. .. .. .. 
;				>>> 41h 表示'A', 02h 表示‘A’的属性为黑底绿色.
;					B8000~B809F 对应显示器上的第一行.
;					(显示缓冲区160bytes 对应显示器第一行的80bytes)
;	B800:00A0	.. .. .. .. .. .. .. .. .. .. .. .. .. .. .. ..
;		:
;	B800:7FF0	.. .. .. .. .. .. .. .. .. .. .. .. .. .. .. ..
;
;
;	三、RGB & 光学三原色 & RGB颜色查询对照表
;		bit		7	6	5	4	3	2	1	0
;		含义	BL	R	G	B	I	R	G	B
;				--  ----------  -   ---------
;				闪烁   背景    高亮	  前景
;		R - Red   红
;		G - Green 绿
;		B - Blue  蓝
;			
;		如:
;		黑色：000b
;		白色：111b
;		黑底白字: 		00000111b = 07h (-d B800:0, 看到的默认属性 byte 确实都是 07h)
;		蓝底白字：		00010111b = 17h
;		白底闪烁蓝字：	11110001b (PS: 闪烁功能需要在全屏DOS下才有效！)
;
;		光学三原色：红+绿=黄；绿+蓝=青； 蓝+红=品红(深红); 红+绿+蓝=白
;



;////////////////////////////////////////////////////////////////////////////////
;	功能:
;		在屏幕中间显示绿色的字符串 'Welcome to zhq3211.'
;	解读：
;		屏幕第1行，对应显示缓冲区的 B800:0000h~B800:009Fh
;	 	绿色的'Welcome to zhq3211.' -- 第11行,第30个字符开始(1-25行)，对应显示缓冲区的 B800:0AA0h+1Eh~B800:0B3Fh
;///////////////////////////////////////////////////////////////////////////////

assume cs:code, ds:data, ss:stack

;============================
;DS:[.]
;	定义字符串，放在 DS段寄存器
;============================
data segment
	db 'W-e-l-c-o-m-e- -t-o- -z-h-q-3-2-1-1-.-' 
	;'Welcome to zhq3211.' 想使用栈，但栈是以字单位，故每个byte后加‘-’； 38bytes
	;'-' 便于出栈是去掉高位.
data ends


;====================================
;SS:SP 
;	定义栈空间，大小为20个bytes (值=0)
;====================================
stack segment
	db 40 dup(0)
stack ends


;================================
;CS:IP
;	代码段
;================================
code segment

start:
	;==============================================
	;将字符串逆序放入栈空间('Welcome to zhq3211.')
	;利用栈，修改字符串后，进栈：
	;	'W-e-l-c-o-m-e- -t-o- -z-h-q-3-2-1-1-.-' 
	;==============================================
	mov ax, data
	mov ds, ax		;初始化 ds:[.]
	
	mov ax, stack
	mov ss, ax
	mov sp, 0		;初始化 SS:SP
	
	mov cx, 19		;共循环19次,栈的操作单位为字类型,
	mov bx, 36		;先指向 ds段 的末端，ds:[36]='.-'
S_Stack1:
	mov ax, ds:[bx]	;ds:[18]
	push ax			;将字符串入栈(一次2byte)
	sub bx, 2 	
	LOOP S_Stack1	;循环完，栈空间保存了改写后的字符串
	;========================================================
	;屏幕第11行中间显示 绿色 的字符串('Welcome to zhq3211.')
	;========================================================
	mov ax, 0B800H
	mov ds, ax	;显存缓冲区范围 B800:0000h~B800:7FFFh

	mov bx, 640h+3Ch 	;对应第11行(640h-6DFh),第30(3Ch=60)个字符
	
	mov cx, 19			;原字符串为19byte. 'Welcome to zhq3211.'
S1:	pop ax
	mov ds:[bx], ax		;出栈(低位为所求)
	
	mov ax, 02h			;字符属性：绿色字体
	mov ds:[bx+1], ax	;更改高位
	
	add bx,2	
	loop S1


	mov ax,4c00h
	int 21h
code ends
end start